{"class_name": "Functional", "config": {"name": "model_1", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30781], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "registered_name": null, "name": "inputs", "inbound_nodes": []}, {"module": "model.layers_custom", "class_name": "Diagonal", "config": {"name": "h0", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 30781], "units": 30781, "activation": "tanh", "use_bias": true}, "registered_name": "Diagonal", "build_config": {"input_shape": [null, 30781]}, "name": "h0", "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_0", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 30781]}, "name": "dropout_0", "inbound_nodes": [[["h0", 0, 0, {"training": false}]]]}, {"module": "model.layers_custom", "class_name": "SparseTF", "config": {"name": "h1", "trainable": true, "dtype": "float32", "units": 146, "activation": "tanh", "use_bias": true, "nonzero_ind": {"class_name": "__numpy__", "config": {"value": [], "dtype": "int64"}}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "W_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}}, "registered_name": "SparseTF", "build_config": {"input_shape": [null, 30781]}, "name": "h1", "inbound_nodes": [[["dropout_0", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 146]}, "name": "dropout_1", "inbound_nodes": [[["h1", 0, 0, {"training": false}]]]}, {"module": "model.layers_custom", "class_name": "SparseTF", "config": {"name": "h2", "trainable": true, "dtype": "float32", "units": 26, "activation": "tanh", "use_bias": true, "nonzero_ind": {"class_name": "__numpy__", "config": {"value": [[0, 23], [1, 9], [2, 10], [3, 14], [4, 1], [5, 1], [6, 18], [7, 7], [8, 11], [9, 1], [10, 0], [11, 5], [12, 3], [13, 17], [13, 20], [14, 5], [15, 3], [16, 21], [17, 7], [18, 5], [19, 21], [20, 23], [21, 11], [22, 7], [23, 24], [24, 10], [25, 6], [26, 5], [27, 6], [28, 10], [29, 23], [30, 8], [31, 7], [32, 23], [33, 11], [34, 1], [35, 16], [36, 6], [37, 23], [38, 15], [39, 21], [40, 2], [41, 14], [42, 13], [43, 11], [44, 11], [45, 8], [46, 6], [47, 21], [48, 5], [49, 13], [50, 0], [51, 1], [52, 7], [53, 14], [54, 24], [55, 10], [56, 7], [57, 21], [58, 1], [59, 10], [60, 21], [61, 1], [62, 1], [63, 19], [64, 13], [65, 21], [66, 9], [67, 21], [68, 21], [69, 9], [70, 1], [71, 17], [72, 10], [73, 12], [74, 11], [75, 9], [76, 21], [77, 11], [78, 4], [79, 9], [80, 0], [81, 23], [82, 14], [83, 11], [84, 18], [85, 24], [86, 10], [87, 4], [88, 5], [89, 5], [90, 19], [91, 16], [92, 12], [93, 12], [94, 15], [95, 25], [96, 22], [97, 21], [98, 23], [99, 2], [100, 11], [101, 0], [102, 11], [103, 5], [104, 16], [105, 0], [106, 21], [107, 2], [108, 11], [109, 13], [110, 20], [111, 1], [112, 21], [113, 1], [114, 6], [115, 0], [116, 22], [117, 10], [118, 1], [119, 23], [120, 1], [121, 0], [122, 5], [123, 3], [124, 9], [125, 5], [126, 1], [127, 6], [128, 23], [129, 20], [130, 0], [131, 23], [132, 21], [133, 10], [134, 0], [135, 13], [136, 7], [137, 1], [138, 5], [139, 6], [140, 1], [141, 13], [142, 7], [143, 21], [144, 21], [145, 13]], "dtype": "int64"}}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "W_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}}, "registered_name": "SparseTF", "build_config": {"input_shape": [null, 146]}, "name": "h2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "o_linear1", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.004999999888241291}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 30781]}, "name": "o_linear1", "inbound_nodes": [[["h0", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "o_linear2", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 146]}, "name": "o_linear2", "inbound_nodes": [[["h1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "o_linear3", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 26]}, "name": "o_linear3", "inbound_nodes": [[["h2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "o1", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "o1", "inbound_nodes": [[["o_linear1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "o2", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "o2", "inbound_nodes": [[["o_linear2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "o3", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "o3", "inbound_nodes": [[["o_linear3", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0]], "output_layers": [["o1", 0, 0], ["o2", 0, 0], ["o3", 0, 0]]}, "keras_version": "2.15.0", "backend": "tensorflow"}