{"class_name": "Functional", "config": {"name": "model_3", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30781], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "registered_name": null, "name": "inputs", "inbound_nodes": []}, {"module": "model.layers_custom", "class_name": "Diagonal", "config": {"name": "h0", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 30781], "units": 30781, "activation": "tanh", "use_bias": true}, "registered_name": "Diagonal", "build_config": {"input_shape": [null, 30781]}, "name": "h0", "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_0", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 30781]}, "name": "dropout_0", "inbound_nodes": [[["h0", 0, 0, {"training": false}]]]}, {"module": "model.layers_custom", "class_name": "SparseTF", "config": {"name": "h1", "trainable": true, "dtype": "float32", "units": 146, "activation": "tanh", "use_bias": true, "nonzero_ind": {"class_name": "__numpy__", "config": {"value": [], "dtype": "int64"}}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "W_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}}, "registered_name": "SparseTF", "build_config": {"input_shape": [null, 30781]}, "name": "h1", "inbound_nodes": [[["dropout_0", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 146]}, "name": "dropout_1", "inbound_nodes": [[["h1", 0, 0, {"training": false}]]]}, {"module": "model.layers_custom", "class_name": "SparseTF", "config": {"name": "h2", "trainable": true, "dtype": "float32", "units": 26, "activation": "tanh", "use_bias": true, "nonzero_ind": {"class_name": "__numpy__", "config": {"value": [[0, 24], [1, 1], [2, 19], [3, 1], [4, 17], [5, 18], [6, 6], [7, 19], [8, 1], [9, 9], [10, 6], [11, 7], [12, 11], [13, 12], [14, 13], [15, 15], [16, 19], [17, 4], [18, 16], [19, 11], [20, 2], [21, 25], [22, 5], [23, 1], [24, 14], [25, 6], [26, 13], [27, 24], [28, 12], [29, 24], [30, 11], [31, 2], [32, 7], [33, 4], [34, 20], [35, 4], [36, 20], [37, 13], [38, 1], [39, 20], [40, 22], [41, 20], [42, 15], [43, 22], [44, 6], [45, 20], [46, 24], [47, 18], [48, 3], [49, 4], [50, 13], [51, 11], [52, 8], [53, 24], [54, 8], [55, 20], [56, 13], [57, 6], [58, 18], [59, 6], [60, 11], [61, 19], [62, 0], [63, 19], [64, 19], [65, 25], [66, 0], [66, 5], [67, 23], [68, 12], [69, 1], [70, 16], [71, 18], [72, 14], [73, 24], [74, 21], [75, 24], [76, 18], [77, 24], [78, 12], [79, 18], [80, 20], [81, 21], [82, 8], [83, 12], [84, 19], [85, 4], [86, 20], [87, 24], [88, 6], [89, 13], [90, 20], [91, 1], [92, 1], [93, 19], [94, 5], [95, 18], [96, 14], [97, 12], [98, 1], [99, 23], [100, 20], [101, 17], [102, 8], [103, 6], [104, 13], [105, 20], [106, 3], [107, 19], [108, 18], [109, 11], [110, 22], [111, 6], [112, 8], [113, 12], [114, 20], [115, 9], [116, 13], [117, 10], [118, 18], [119, 13], [120, 18], [121, 18], [122, 14], [123, 19], [124, 20], [125, 18], [126, 18], [127, 12], [128, 13], [129, 19], [130, 1], [131, 15], [132, 18], [133, 20], [134, 25], [135, 18], [136, 3], [137, 20], [138, 20], [139, 4], [140, 4], [141, 1], [142, 18], [143, 21], [144, 8], [145, 8]], "dtype": "int64"}}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "kernel_initializer": {"module": "keras.initializers", "class_name": "LecunUniform", "config": {"seed": null}, "registered_name": null}, "W_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}}, "registered_name": "SparseTF", "build_config": {"input_shape": [null, 146]}, "name": "h2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "o_linear1", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.004999999888241291}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 30781]}, "name": "o_linear1", "inbound_nodes": [[["h0", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "o_linear2", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 146]}, "name": "o_linear2", "inbound_nodes": [[["h1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "o_linear3", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.009999999776482582}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 26]}, "name": "o_linear3", "inbound_nodes": [[["h2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "o1", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "o1", "inbound_nodes": [[["o_linear1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "o2", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "o2", "inbound_nodes": [[["o_linear2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "o3", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "o3", "inbound_nodes": [[["o_linear3", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0]], "output_layers": [["o1", 0, 0], ["o2", 0, 0], ["o3", 0, 0]]}, "keras_version": "2.15.0", "backend": "tensorflow"}